org/doom_config.org
#+TITLE: Doom Config
#+AUTHOR: Andrzej Krawiec
#+PROPERTY: header-args :tangle "~/.doom.d/config.el" :cache no

* Prerequisites
** Fonts
JetBrainsMono fonts can be install from almost every package manager.
#+begin_example
sudo pacman -Sy ttf-jetbrains-mono
#+end_example
** Superstar
To replace asterisk with pretty org bullets you need to add `(org +pretty)` to `init.el`
* Identifier
Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets. It is optional.
#+begin_src emacs-lisp
(setq user-full-name "Andrzej Krawiec"
      user-mail-address "andkrawiec@gmail.com")
#+end_src

* Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-ir-black)
#+end_src

* Font
JetBrainsMono are likely not installed on your system by default (check Prerequisites)
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono" :size 16)
      doom-variable-pitch-font (font-spec :family "JetBrainsMono" :size 19))
#+end_src

* Org-mode
** Directory
#+begin_src emacs-lisp
(after! org
  (setq org-directory "~/org/"
        org-agenda-files '("~/org/agenda.org")
        org-default-notes-file (expand-file-name "notes.org" org-directory)))
#+end_src
** Superstar
#+begin_src emacs-lisp
(after! org
  (setq org-ellipsis " ▼ "
        org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        org-superstar-item-bullet-alist '((?+ . ?➤) (?- . ?✦))))
#+end_src
** Header size
#+begin_src emacs-lisp
(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.4))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
)
#+end_src
* Line numbers
| Type      | Description           |
|-----------+-----------------------|
| t         | Default line numbers  |
| 'relative | Relative line numbers |
| nil       | Line numbers disabled |
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

* Fallback
If 'somenting went wrong'
#+begin_src emacs-lisp
(setq doom-fallback-buffer "*dashboard*")
#+end_src

* Packages
** Shell
#+begin_src emacs-lisp
(setq eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))
(map! :leader
      :desc "Eshell"               "e s"  #'eshell
      :desc "Eshell popup toggle"  "e t"  #'+eshell/toggle)
#+end_src
** Beacon
Never lose your cursor
#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src
